app/Models/AparenciaModelConsulta.php

SELECT *
FROM `loja_aparencia`
WHERE `id_empresa` = 165
---
    public function getConfiguracoes($idEmpresa = null): array
    {
        // Se já tiver carregado as configurações, retorna
        if ($this->configuracoes !== null) {
            return $this->configuracoes;
        }

        try {
            // Se não foi informado o ID da empresa, usa o da sessão
            if ($idEmpresa === null) {
                $idEmpresa = $this->idEmpresa;
            }

            // Usando Query Builder do CodeIgniter
            $query = $this->db->table('loja_aparencia')
                             ->where('id_empresa', $idEmpresa)
                             ->get();