app/Models/ConfiguracaoModelConsulta.php

SELECT `c`.*, `a`.`cor_primaria`, `a`.`cor_secundaria`, `a`.`cor_texto`, `a`.`cor_fundo`, `a`.`fonte`, `a`.`logo`, `a`.`banner_principal`, `s`.`meta_title` as `meta_titulo`, `s`.`meta_description` as `meta_descricao`, `s`.`og_title`, `s`.`og_description`, `s`.`og_image`
FROM `loja_config` `c`
LEFT JOIN `loja_aparencia` `a` ON `c`.`id_empresa` = `a`.`id_empresa`
LEFT JOIN `loja_seo` `s` ON `c`.`id_empresa` = `s`.`id_empresa`
WHERE `c`.`id_empresa` = 165
---
    public function getConfiguracoes($idEmpresa = null): array
    {
        try {
            // Se não foi informado o ID da empresa, usa o padrão
            if ($idEmpresa === null) {
                $idEmpresa = $this->idEmpresa;
            }

            // Busca configurações gerais
            $builder = $this->db->table('loja_config c');
            $builder->select('c.*, a.cor_primaria, a.cor_secundaria, a.cor_texto, a.cor_fundo, a.fonte, a.logo, a.banner_principal');
            $builder->select('s.meta_title as meta_titulo, s.meta_description as meta_descricao, s.og_title, s.og_description, s.og_image');
            $builder->join('loja_aparencia a', 'c.id_empresa = a.id_empresa', 'left');
            $builder->join('loja_seo s', 'c.id_empresa = s.id_empresa', 'left');
            $builder->where('c.id_empresa', $idEmpresa);

            $query = $builder->get();