app/Models/ConfiguracaoModel.php

SELECT *
FROM `loja_config`
WHERE `loja_config`.`id_empresa` = 165
AND `id_empresa` = 165
---
    public function getConfiguracoes(?int $idEmpresa = null): array
    {
        // Se não foi informado, usa o ID da empresa atual
        if ($idEmpresa === null) {
            $idEmpresa = $this->idEmpresa;
        }

        try {
            // Busca a configuração da loja
            $builder = $this->builder('loja_config');
            $builder->where('id_empresa', $idEmpresa);
            $query = $builder->get();